[
  {
    "id": 2016001,
    "featured": false,
    "name": "Sistema de Gestión PACE",
    "endYear": "2016",
    "company": "PACE UCN",
    "companyUrl": "https://paceucn.cl",
    "companyImgUrl": "/images/logo-pace.png",
    "description": "Sistema para apoyar los procesos de gestión desarrollados por el programa PACE. Permite el registro y seguimiento de los estudiantes a los que se les brinda apoyo académico, así como de las distintas actividades realizadas y sus participantes. Implementa diversos reportes administrativos, según los requerimientos necesarios para responder a las consultas habituales por parte del ministerio de educación.",
    "techList": [
      "JQuery",
      "Bootstrap",
      "PHP",
      "MySQL"
    ]
  },
  {
    "id": 2016002,
    "featured": false,
    "name": "Sistema de Gestión de la Calidad",
    "endYear": "2016",
    "company": "Universidad Católica del Norte",
    "companyUrl": "https://www.ucn.cl",
    "companyImgUrl": "/images/ucn-logo192.png",
    "description": "Sistema desarrollado para la escuela de ingeniería, con el objetivo de implementar reportes gráficos para la visualización de los distintos indicadores clave de rendimiento definidos.",
    "techList": [
      "JavaScript",
      "DC.js",
      "Bootstrap",
      "PHP",
      "API externa"
    ]
  },
  {
    "id": 2016003,
    "featured": false,
    "name": "Sistema de Gestión e Inventario",
    "endYear": "2016",
    "company": "Ingeniería Gestión y Desarrollo S.A.",
    "companyUrl": "https://igdchile.com",
    "companyImgUrl": "/images/logo-igd.png",
    "description": "Actualización y termino del sistema de gestión e inventario interno de la empresa. Debido a que para el desarrollo anterior se había llevado a cabo utilizando la herramienta Dreamweaver fue necesario realizar una refactorización completa del código, para mejorar escalabilidad y calidad general para mantenciones futuras, así como un rediseño completo a la interfaz de usuario para darle un estilo más moderno y acorde a los estándares del momento.",
    "techList": [
      "JQuery",
      "PHP",
      "MySQL"
    ]
  },
  {
    "id": 2017001,
    "featured": true,
    "name": "SIVRIDT Publicaciones",
    "endYear": "2017",
    "company": "Universidad Católica del Norte",
    "companyUrl": "https://www.ucn.cl",
    "companyImgUrl": "/images/ucn-logo192.png",
    "description": "La universidad tiene como uno de sus objetivos el impulsar las publicaciones realizadas por académicos en revistas de investigación reconocidas. Para ello se comprometió a implementar un sistema web para facilitar la inscripción de dichas publicaciones, así como simplificar el proceso de pago de los incentivos monetarios asociados. El sistema también presenta varios reportes para entregar la información requerida a las consultas más comunes que deben responder los encargados.",
    "techList": [
      "Javascript (ES6+)",
      "React",
      "Express",
      "PostgreSQL"
    ]
  },
  {
    "id": 2018001,
    "featured": false,
    "name": "SIVRIDT Donaciones",
    "endYear": "2018",
    "company": "Universidad Católica del Norte",
    "companyUrl": "https://www.ucn.cl",
    "companyImgUrl": "/images/ucn-logo192.png",
    "description": "El proyecto tiene como objetivo facilitar el proceso de registro y seguimiento de los proyectos financiados a través de donaciones externas. El proyecto sigue las intenciones de la universidad para fomentar y facilitar el trabajo de los académicos asociados a proyectos de investigación.",
    "techList": [
      "Javascript (ES6+)",
      "React",
      "Express",
      "PostgreSQL"
    ]
  },
  {
    "id": 2018002,
    "featured": false,
    "name": "Sistema de seguimiento de prácticas",
    "endYear": "2018",
    "company": "Universidad Católica del Norte",
    "companyUrl": "https://www.ucn.cl",
    "companyImgUrl": "/images/ucn-logo192.png",
    "description": "Sistema realizado para facilitar el proceso de prácticas, permitiendo realizar el registro de ofertas recibidas, la inscripción por parte del estudiante y todo el seguimiento correspondiente hasta la evaluación final.",
    "techList": [
      "Javascript (ES6+)",
      "React",
      "Express",
      "PostgreSQL"
    ]
  },
  {
    "id": 2019001,
    "featured": false,
    "name": "Sistema de seguimiento de trenes",
    "endYear": "2019",
    "company": "FCAB",
    "companyUrl": "https://www.fcab.cl",
    "companyImgUrl": "/images/logo-fcab.png",
    "description": "Con el objetivo de reemplazar al antiguo sistema para el seguimiento en tiempo real de los trenes en terreno. Utilizando las capacidades actuales de los sistemas web y utilizando la biblioteca gráfica D3, se logró mantener y mejorar las funcionalidades presentes en el sistema anterior.",
    "techList": [
      "JavaScript",
      "D3.js",
      "API Rest"
    ]
  },
  {
    "id": 2019002,
    "featured": false,
    "name": "SIVRIDT Educación Continua",
    "endYear": "2019",
    "company": "Universidad Católica del Norte",
    "companyUrl": "https://www.ucn.cl",
    "companyImgUrl": "/images/ucn-logo192.png",
    "description": "El proyecto tiene como objetivo facilitar el proceso de registro de los distintos planes de formación existentes (cursos, diplomados, etc.) e impartidos por la universidad. Así como también la ejecución del mismo, permitiendo el ingreso de la información más relevante para reportabilidad.",
    "techList": [
      "Javascript (ES6+)",
      "React",
      "Express",
      "PostgreSQL"
    ]
  },
  {
    "id": 2020001,
    "featured": true,
    "name": "Mejora del proceso de proyección de trenes",
    "endYear": "2020",
    "company": "FCAB",
    "companyUrl": "https://www.fcab.cl",
    "companyImgUrl": "/images/logo-fcab.png",
    "description": "Realizado con el objetivo de mejorar el sistema actual para la proyección del recorrido realizado por los trenes a disposición de la empresa, con el fin de utilizar de manera óptima la (única) vía férrea existente para ello.",
    "techList": [
      "Javascript (ES6+)",
      "React",
      "Koa.js",
      "PostgreSQL",
      "Python"
    ]
  },
  {
    "id": 2020002,
    "featured": true,
    "name": "MLP-CRI",
    "endYear": "2020",
    "company": "Minera Los Pelambres",
    "companyUrl": "https://web.pelambres.cl",
    "companyImgUrl": "/images/logo-pelambres.png",
    "description": "Sistema de revisión de rutas y notificación de amenazas georreferenciadas, con el objetivo del sistema es digitalizar dos procesos claves de la empresa. El primero consiste en registrar los checklist de revisión y mantenimiento del equipamiento a disposición. Y además el ingreso (y seguimiento) de los problemas o factores de riesgo presentes en los distintos ductos para transporte de material.",
    "techList": [
      "Javascript (ES6+)",
      "React",
      "Koa.js",
      "PostgreSQL",
      "React Native",
      "SQLite"
    ]
  },
  {
    "id": 2021001,
    "featured": false,
    "name": "Sistema de seguimiento de prácticas",
    "endYear": "2021",
    "company": "Universidad Católica del Norte",
    "companyUrl": "https://www.ucn.cl",
    "companyImgUrl": "/images/ucn-logo192.png",
    "description": "Con el fin de retomar la implementación del sistema para apoyar en el proceso de prácticas (detenido debido a cambios en la administración de la facultad) se solicitaron diversos cambios y mejoras para simplificar el proceso general y fomentar su uso a través de una marcha blanca.",
    "techList": [
      "Javascript (ES6+)",
      "React",
      "Koa.js",
      "PostgreSQL"
    ]
  },
  {
    "id": 2021002,
    "featured": false,
    "name": "Sistema de control de asistencia de operadores de trenes",
    "endYear": "2021",
    "company": "FCAB",
    "companyUrl": "https://www.fcab.cl",
    "companyImgUrl": "/images/logo-fcab.png",
    "description": "Gracias a la confianza adquirida en los desarrollos previos, en esta ocasión se encargó la actualización del sistema para control de asistencia de los operadores de trenes con el propósito de optimizar los tiempos de respuesta del sistema e incorporar mejoras al sistema existente.",
    "techList": [
      "Javascript",
      "PHP",
      "PostgreSQL"
    ]
  },
  {
    "id": 2021003,
    "featured": true,
    "name": "Sistema de seguimiento a la formación de especialidades médicas",
    "endYear": "2021",
    "company": "Universidad Católica del Norte",
    "companyUrl": "https://www.ucn.cl",
    "companyImgUrl": "/images/ucn-logo192.png",
    "description": "El objetivo del sistema es facilitar el proceso de calificación de estudiantes de medicina en las distintas especiales ofrecidas por la universidad. El sistema permite diseñar las rubricas de evaluación a través de un sistema de administración web y completarlas por los docentes con la aplicación móvil disponible para iOS y Android.",
    "techList": [
      "Javascript (ES6+)",
      "React",
      "Koa.js",
      "PostgreSQL",
      "React Native",
      "SQLite",
      "Process Maker"
    ]
  },
  {
    "id": 2021004,
    "featured": true,
    "name": "DGPRE",
    "endYear": "2021",
    "company": "Universidad Católica del Norte",
    "companyUrl": "https://www.ucn.cl",
    "companyImgUrl": "/images/ucn-logo192.png",
    "description": "Debido a la pandemia del COVID-19 la universidad se vio en la necesidad de fortalecer a la unidad de Registro Curricular para permitir la solicitud y entrega de documentos esenciales para los estudiantes de manera no presencial. El sistema permite realizar el proceso completo desde la solicitud por parte del estudiante, la recepción del pago (a través de Webpay) y la entrega del documento digital generado automáticamente.",
    "techList": [
      "Javascript (ES6+)",
      "React",
      "Koa.js",
      "PostgreSQL"
    ]
  },
  {
    "id": 2021005,
    "featured": false,
    "name": "Sistema de gestión para la unidad CIMET",
    "endYear": "2021",
    "company": "Universidad Católica del Norte",
    "companyUrl": "https://www.ucn.cl",
    "companyImgUrl": "/images/ucn-logo192.png",
    "description": "El sistema permite la definición de programas de especialización en distintos niveles para académicos, agregar participantes y realizar el seguimiento de las competencias definidas por nivel, el cual es calculado de manera automática en base a los cursos aprobados registrados para el académico como aprobados y la validación de sus conocimientos previos.",
    "techList": [
      "Javascript (ES6+)",
      "React",
      "Koa.js",
      "PostgreSQL"
    ]
  },
  {
    "id": 2022001,
    "featured": true,
    "name": "Sistema para la gestión ALS",
    "endYear": "2022",
    "company": "Asesoría Laboral y Sindical",
    "companyUrl": "https://als.cl/",
    "companyImgUrl": "/images/logo-als.png",
    "description": "Digitalización de los procesos de gestión para la empresa ALS. El objetivo principal es permitir llevar un seguimiento del estado para cada uno de los juicios, facilitando al administrador registrar la parte contable asociada. Como adicional se incorporó la calendarización de los eventos por juicio con el envió de la invitación por correo a los participantes asociados.",
    "techList": [
      "Javascript (ES6+)",
      "React",
      "Koa.js",
      "PostgreSQL"
    ]
  }
]
